
# Напишите программу, которая считывает три строки по очереди,
# а затем выводит их в обратной последовательности, каждую на отдельной строчке.

enter_1 = input()
enter_2 = input()
enter_3 = input()
print(enter_3)
print(enter_2)
print(enter_1)